tutorials/multiphase/interFoam/RAS/weirOverflow/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-18  0 -0.5)
    (  0  0 -0.5)
    ( 30  0 -0.5)
    ( 90  0 -0.5)
    (-18 30 -0.5)
    (  0 30 -0.5)
    ( 15 30 -0.5)
    ( 90 30 -0.5)
    (-18 54 -0.5)
    (  0 54 -0.5)
    ( 15 54 -0.5)
    ( 90 54 -0.5)

    (-18  0 0.5)
    (  0  0 0.5)
    ( 30  0 0.5)
    ( 90  0 0.5)
    (-18 30 0.5)
    (  0 30 0.5)
    ( 15 30 0.5)
    ( 90 30 0.5)
    (-18 54 0.5)
    (  0 54 0.5)
    ( 15 54 0.5)
    ( 90 54 0.5)
);

blocks
(
    hex (0 1 5 4 12 13 17 16) (20 20 1) simpleGrading (1 0.5 1)
    hex (2 3 7 6 14 15 19 18) (60 40 1) simpleGrading (1 2 1)
    hex (4 5 9 8 16 17 21 20) (20 24 1) simpleGrading (1 1 1)
    hex (5 6 10 9 17 18 22 21) (15 24 1) simpleGrading (1 1 1)
    hex (6 7 11 10 18 19 23 22) (60 24 1) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    patch inlet
    (
        (0 12 16 4)
        (4 16 20 8)
    )
    patch outlet
    (
        (7 19 15 3)
        (11 23 19 7)
    )
    wall lowerWall
    (
        (0 1 13 12)
        (1 5 17 13)
        (5 6 18 17)
        (2 14 18 6)
        (2 3 15 14)
    )
    patch atmosphere
    (
        (8 20 21 9)
        (9 21 22 10)
        (10 22 23 11)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
